{
  "auto_mapping": null,
  "base_model_name_or_path": "google/t5-v1_1-xl",
  "encoder_hidden_size": 2048,
  "inference_mode": true,
  "num_attention_heads": 32,
  "num_layers": 24,
  "num_transformer_submodules": 2,
  "num_virtual_tokens": 256,
  "peft_type": "PREFIX_TUNING",
  "prefix_projection": false,
  "revision": null,
  "task_type": "SEQ_2_SEQ_LM",
  "token_dim": 2048
}