{
  "auto_mapping": null,
  "base_model_name_or_path": "t5-large",
  "inference_mode": true,
  "num_attention_heads": 16,
  "num_layers": 24,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 128,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Classify the sentiment of the given sentence to either Positive or Negative.",
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 1024,
  "tokenizer_kwargs": null,
  "tokenizer_name_or_path": "t5-large"
}